<br> 
<center><img src="https://i.imgur.com/hkb7Bq7.png" width="500"></center>


### Prof. José Manuel Magallanes, PhD

* Visiting Professor, Evans School of Public Policy and Governance / Senior Data Science Fellow, eScience Institute, University of Washington, [magajm@uw.edu](mailto:magajm@uw.edu)

* Associate Professor, Departamento de Ciencias Sociales, Pontificia Universidad Católica del Perú, [jmagallanes@pucp.edu.pe](mailto:jmagallanes@pucp.edu.pe)

_____

_____

<a id='home'></a>

# Introduction to Python

* DATA STRUCTURES
    - [Native Data Structures](#basic_ds).

    - [NonNative Data Structures](#complex_ds).

* DATA PRE PROCESSING
    - [Data cleaning and formatting](#cleanformat).

    - [Integration and Saving](#integratesave).

# 1. Basic Data Structures

Python has basic native structures, like lists, tuples and dictionaries.

## a.  **LISTS** 

Lists are the most flexible structure to save or contain data elements.

In [1]:
ages=[32,33,28,30,29]

Above we have created some lists. Lists can contain any values. Lists support different operations:

* **Accessing**:

Keep in mind the positions in Python start in **0**.

In [2]:
# one element
ages[0]

32

In [3]:
# last one
ages[-1]

29

In [4]:
#all but two last ones
ages[:-2]

[32, 33, 28]

In [5]:
#non consecutive
# I want: [32, 28] from [32,33,28,30,29]
ages[0:4:2] # start:end:step (open at end)

[32, 28]

* **Adding elements**:

In [6]:
# I want: [32, 28, 30] from [32,33,28,30,29]
# difficult to understand?
ages[0:4:2] + [ages[3]]

[32, 28, 30]

In [7]:
ages[0:4:2] + ages[3]

TypeError: can only concatenate list (not "int") to list

Always check data type when adding trying to add elements:

In [8]:
type(ages[0:4:2])

list

In [9]:
type(ages[3])

int

Using the function **append**:

In [10]:
aList=ages[0:4:2]
aList

[32, 28]

In [11]:
aList.append(ages[3])

In [12]:
aList

[32, 28, 30]

Using the function **extend**:

In [13]:
list1=[1,2,3]
list2=[4,5,6]
list1.extend(list2)
list1

[1, 2, 3, 4, 5, 6]

* **Modifying**:

In [14]:
country=["China", "Senegal", "España", "Norway","Korea"]


# by position
country[2]="Spain"

# list changed:
country

['China', 'Senegal', 'Spain', 'Norway', 'Korea']

In [15]:
# by value
country=["PR China" if x == "China" else x for x in country]

# list changed:
country

['PR China', 'Senegal', 'Spain', 'Norway', 'Korea']

* **Deleting**

In [16]:
# by position
del country[-1] #last value

# list changed:
country

['PR China', 'Senegal', 'Spain', 'Norway']

In [17]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]

# by position
names.pop() #last value by default

# list changed:
names

['Qing', 'Françoise', 'Raúl', 'Bjork']

In [18]:
# only 'del' works for several positions

lista=[1,2,3,4,5,6]
del lista[1:3]

#now:
lista

[1, 4, 5, 6]

In [19]:
lista=[5,7,13,13,29,29,33]

# by value
lista.remove(29) 

# list changed:
lista # just first ocurrence of value!!

[5, 7, 13, 13, 29, 33]

In [20]:
# deleting every  value:

lista=[1,'a',45,'b','a']
lista=[x for x in lista if x!='a']

# you get:
lista

[1, 45, 'b']

## b.  **TUPLES**

Tuples are inmutable structures in Python, they look like lists but do not share much of their functionality:

In [21]:
# a tuple:
weekend=("Friday", "Saturday", "Sunday")

You can access:

In [22]:
weekend[0]

'Friday'

But deleting, modifying, and inserting a value is **NOT PERMITTED**.




## c. **DICTIONARIES**  

*Dicts* work in a more sophisticated way, as they have a **'key'**:**'value'** structure:

In [23]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
ages=[32,33,28,30,29]
education=["Bach", "Bach", "Master", "PhD","PhD"]


classroom={'student':names,'age':ages,'edu':education}
# see it:

classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD']}

Dicts do not use indexes to access values:

In [24]:
classroom[0]

KeyError: 0

Dicts use keys:

In [25]:
classroom['student']

['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']

To see al the keys:

In [26]:
classroom.keys()

dict_keys(['student', 'age', 'edu'])

Notice that I created a dictionary where the value is not ONE but a LIST of values.

If you wish to see all the key and values:

In [27]:
classroom.items()

dict_items([('student', ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']), ('age', [32, 33, 28, 30, 29]), ('edu', ['Bach', 'Bach', 'Master', 'PhD', 'PhD'])])

To visit each one:

In [28]:
#wrong:
[(key,value) for key, value in classroom]

ValueError: too many values to unpack (expected 2)

In [29]:
# good:

[(key,value) for key, value in classroom.items()]

[('student', ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']),
 ('age', [32, 33, 28, 30, 29]),
 ('edu', ['Bach', 'Bach', 'Master', 'PhD', 'PhD'])]

Notice that the previous dicts could be represented as a table, but dicts are no limited to table-like structures:

In [30]:
student1={'names':'Peter','language':['english','spanish'],'age':14,'sex':"F"}
student2={'names':'Mary','language':['english','spanish','french'],'age':16,'sex':"M"}
student3={'names':'John','language':['english'],'age':15,'sex':None}

You can create this dict:

In [31]:
class1={'students':[student1,student2,student3]}
class1

{'students': [{'names': 'Peter',
   'language': ['english', 'spanish'],
   'age': 14,
   'sex': 'F'},
  {'names': 'Mary',
   'language': ['english', 'spanish', 'french'],
   'age': 16,
   'sex': 'M'},
  {'names': 'John', 'language': ['english'], 'age': 15, 'sex': None}]}

If you have two lists:

In [32]:
list1=['a','b','c']
list2=['A','B','C']

You can create a dict like this:

In [33]:
{key:value for key,value in zip(list1,list2)}

{'a': 'A', 'b': 'B', 'c': 'C'}

Once you access a value, you can modify it:

In [34]:
classroom['student']

['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']

In [35]:
classroom['student'][2]='Raul'
classroom['student']

['Qing', 'Françoise', 'Raul', 'Bjork', 'Marie']

You can delete a key and its elements:

In [36]:
del classroom['age'] 
classroom

{'student': ['Qing', 'Françoise', 'Raul', 'Bjork', 'Marie'],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD']}

You can also use pop:

In [37]:
classroom.pop('edu')
classroom

{'student': ['Qing', 'Françoise', 'Raul', 'Bjork', 'Marie']}

You can not use _append_ to add an element, you need **update**:

In [38]:
countries=["China", "Senegal", "España", "Norway","Korea"]

classroom.update({'country':countries,'age':ages})
# now:
classroom

{'student': ['Qing', 'Françoise', 'Raul', 'Bjork', 'Marie'],
 'country': ['China', 'Senegal', 'España', 'Norway', 'Korea'],
 'age': [32, 33, 28, 30, 29]}

[home](#home)

______

<a id='complex_ds'></a>


# Non Native Data Structures

## DATA FRAMES

A **Data frame**  is a complex container of values. The most common analogy is a spreadsheet. To create a data frame, we need to call **pandas**:

In [39]:
import pandas

We can prepare a data frame from a dictionary immediately, but ONLY if you have the same amount of elements in each list representing a column.

In [40]:
# this dict can be used for a data frame:
classroom

{'student': ['Qing', 'Françoise', 'Raul', 'Bjork', 'Marie'],
 'country': ['China', 'Senegal', 'España', 'Norway', 'Korea'],
 'age': [32, 33, 28, 30, 29]}

In [41]:
# our data frame:
students=pandas.DataFrame(classroom)
## see it:
students

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33
2       Raul   España   28
3      Bjork   Norway   30
4      Marie    Korea   29

In that one of the list in the dictionary were shorter that the others, you need this:

In [42]:
#then
students=pandas.DataFrame({key:pandas.Series(value) for key, value in classroom.items()})

# seeing it:
students

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33
2       Raul   España   28
3      Bjork   Norway   30
4      Marie    Korea   29

Sometimes, Python users code like this:

In [43]:
import pandas as pd # renaming the library

students=pd.DataFrame(classroom)
students

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33
2       Raul   España   28
3      Bjork   Norway   30
4      Marie    Korea   29

### Information on the Data frame

In [44]:
# data of structure: list? tuple? dataframe?
type(students)

pandas.core.frame.DataFrame

In [45]:
# data of structure: list? tuple? dataframe?
type(students.age)#this is a SERIES (a column)

pandas.core.series.Series

In [46]:
# type of data in data frame column
students.dtypes

student    object
country    object
age         int64
dtype: object

In [47]:
# type of data and further details
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   country  5 non-null      object
 2   age      5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [48]:
# number of rows and columns
students.shape

(5, 3)

In [49]:
# number of rows:
len(students)

5

In [50]:
# first rows
students.head(2) # compare with: students.tail(2)

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33

In [51]:
# name of columns
students.columns

Index(['student', 'country', 'age'], dtype='object')

If you needed the column names as a list:

In [52]:
students.columns.tolist()# better to see hidden characters

['student', 'country', 'age']

### OPERATIONS on DF:

### a. Accessing

See a column:

In [53]:
#one particular column
students.student

0         Qing
1    Françoise
2         Raul
3        Bjork
4        Marie
Name: student, dtype: object

In [54]:
# or
students['student']

0         Qing
1    Françoise
2         Raul
3        Bjork
4        Marie
Name: student, dtype: object

This looks like a column, but it is not:

In [55]:
students[['student']] # a data frame

     student
0       Qing
1  Françoise
2       Raul
3      Bjork
4      Marie

In [56]:
# this is also a DF
students[['country','student']]

   country    student
0    China       Qing
1  Senegal  Françoise
2   España       Raul
3   Norway      Bjork
4    Korea      Marie

A more _Python_ way:

In [57]:
# using loc (names): 
columnNames=['country','student']
students.loc[:,columnNames]

   country    student
0    China       Qing
1  Senegal  Françoise
2   España       Raul
3   Norway      Bjork
4    Korea      Marie

In [58]:
rowNames=[0,1]
students.loc[rowNames,:]

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33

In [59]:
## Using iloc:
columnPositions=[1,2,0]
students.iloc[:,columnPositions]

   country  age    student
0    China   32       Qing
1  Senegal   33  Françoise
2   España   28       Raul
3   Norway   30      Bjork
4    Korea   29      Marie

### Changing values

If you have a position, you can update values:

In [60]:
students.iloc[4,2]=23 # change is immediate! (no warning)
students

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33
2       Raul   España   28
3      Bjork   Norway   30
4      Marie    Korea   23

In [61]:
students.loc[2,'country']='Spain'
students

     student  country  age
0       Qing    China   32
1  Françoise  Senegal   33
2       Raul    Spain   28
3      Bjork   Norway   30
4      Marie    Korea   23

Same principle can be applied to chanege column names:

In [62]:
students.columns=['studentNames','countryBorn','ageCurrent']
students

  studentNames countryBorn  ageCurrent
0         Qing       China          32
1    Françoise     Senegal          33
2         Raul       Spain          28
3        Bjork      Norway          30
4        Marie       Korea          23

In [63]:
#some names:
changesDictCol={'ageCurrent':'currentAge'}
students.rename(columns=changesDictCol) # a view - change requires 'inplace=True'

  studentNames countryBorn  currentAge
0         Qing       China          32
1    Françoise     Senegal          33
2         Raul       Spain          28
3        Bjork      Norway          30
4        Marie       Korea          23

In [64]:
changesDictRow={0:'First'}
students.rename(index=changesDictRow) # a view - change requires 'inplace=True'

      studentNames countryBorn  ageCurrent
First         Qing       China          32
1        Françoise     Senegal          33
2             Raul       Spain          28
3            Bjork      Norway          30
4            Marie       Korea          23

### Adding a Column

In [65]:
students['education']=education
students

  studentNames countryBorn  ageCurrent education
0         Qing       China          32      Bach
1    Françoise     Senegal          33      Bach
2         Raul       Spain          28    Master
3        Bjork      Norway          30       PhD
4        Marie       Korea          23       PhD

In [66]:
students['sex']=None
students

  studentNames countryBorn  ageCurrent education   sex
0         Qing       China          32      Bach  None
1    Françoise     Senegal          33      Bach  None
2         Raul       Spain          28    Master  None
3        Bjork      Norway          30       PhD  None
4        Marie       Korea          23       PhD  None

In [67]:
students['city']='Seattle'
students

  studentNames countryBorn  ageCurrent education   sex     city
0         Qing       China          32      Bach  None  Seattle
1    Françoise     Senegal          33      Bach  None  Seattle
2         Raul       Spain          28    Master  None  Seattle
3        Bjork      Norway          30       PhD  None  Seattle
4        Marie       Korea          23       PhD  None  Seattle

### Deleting columns

You can modify any values in a data frame, but let me create a **copy** of this data frame to play with:

In [68]:
studentsCopy1=students.copy()
studentsCopy2=studentsCopy1

In [69]:
# This is what you want get rid of:
byeColumns=['sex'] # you can delete more than one

#this is the result
studentsCopy1.drop(columns=byeColumns,inplace=True)
studentsCopy1

  studentNames countryBorn  ageCurrent education     city
0         Qing       China          32      Bach  Seattle
1    Françoise     Senegal          33      Bach  Seattle
2         Raul       Spain          28    Master  Seattle
3        Bjork      Norway          30       PhD  Seattle
4        Marie       Korea          23       PhD  Seattle

In [70]:
studentsCopy2

  studentNames countryBorn  ageCurrent education     city
0         Qing       China          32      Bach  Seattle
1    Françoise     Senegal          33      Bach  Seattle
2         Raul       Spain          28    Master  Seattle
3        Bjork      Norway          30       PhD  Seattle
4        Marie       Korea          23       PhD  Seattle

In [71]:
students

  studentNames countryBorn  ageCurrent education   sex     city
0         Qing       China          32      Bach  None  Seattle
1    Françoise     Senegal          33      Bach  None  Seattle
2         Raul       Spain          28    Master  None  Seattle
3        Bjork      Norway          30       PhD  None  Seattle
4        Marie       Korea          23       PhD  None  Seattle

### Deleting rows

Let me delete a row:

In [72]:
studentsCopy1.drop(index=2,inplace=True) 
studentsCopy1

  studentNames countryBorn  ageCurrent education     city
0         Qing       China          32      Bach  Seattle
1    Françoise     Senegal          33      Bach  Seattle
3        Bjork      Norway          30       PhD  Seattle
4        Marie       Korea          23       PhD  Seattle

As you see, the index dissapeared. Then, _iloc_ and _loc_ may give different results:

In [75]:
# this is OK
studentsCopy1.loc[0,'studentNames']==studentsCopy1.iloc[0,0]

True

In [76]:
# this is not OK
studentsCopy1.loc[3,'studentNames']==studentsCopy1.iloc[3,0]

False

In [78]:
studentsCopy1.loc[3,'studentNames']

'Bjork'

In [79]:
studentsCopy1.iloc[3,0]

'Marie'

In [83]:
# this is worse
studentsCopy1.loc[2,'student']==studentsCopy1.iloc[2,0]

KeyError: 2

After deleting rows, I recommend **resetting the index**:

In [84]:
# a view
studentsCopy1.reset_index()

   index studentNames countryBorn  ageCurrent education     city
0      0         Qing       China          32      Bach  Seattle
1      1    Françoise     Senegal          33      Bach  Seattle
2      3        Bjork      Norway          30       PhD  Seattle
3      4        Marie       Korea          23       PhD  Seattle

In [85]:
studentsCopy1.reset_index(drop=True)

  studentNames countryBorn  ageCurrent education     city
0         Qing       China          32      Bach  Seattle
1    Françoise     Senegal          33      Bach  Seattle
2        Bjork      Norway          30       PhD  Seattle
3        Marie       Korea          23       PhD  Seattle

In [86]:
studentsCopy1.reset_index(drop=True, inplace=False)

  studentNames countryBorn  ageCurrent education     city
0         Qing       China          32      Bach  Seattle
1    Françoise     Senegal          33      Bach  Seattle
2        Bjork      Norway          30       PhD  Seattle
3        Marie       Korea          23       PhD  Seattle

##  Merging

Let me make two data frames from dicts:

In [91]:
dict1={'names':["Qing", "Françoise", "Raúl", "Bjork","Marie"],
'ages':[32,33,28,30,29],
'countries':["China", "Senegal", "España", "Norway","Korea"]}

dict2={'names':["Qing", "Françoise", "Raúl", "Bjork","Marie"],
'education':["Bach", "Bach", "Master", "PhD","PhD"]}

df1=pd.DataFrame(dict1)
df2=pd.DataFrame(dict2)

In [93]:
df12=df1.merge(df2)
df12

       names  ages countries education
0       Qing    32     China      Bach
1  Françoise    33   Senegal      Bach
2       Raúl    28    España    Master
3      Bjork    30    Norway       PhD
4      Marie    29     Korea       PhD

Let's make a little change:

In [90]:
dict3={'NAME':["Qing", "Françoise", "Raúl", "Bjork","Marie"],
'ages':[32,33,28,30,29],
'countries':["China", "Senegal", "España", "Norway","Korea"]}

dict4={'names':["Qing", "Françoise", "Raúl", "Bjork","Marie"],
'education':["Bach", "Bach", "Master", "PhD","PhD"]}

df3=pd.DataFrame(dict3)
df4=pd.DataFrame(dict4)
df34=df3.merge(df4,left_on="NAME",right_on="names",)
df34

        NAME  ages countries      names education
0       Qing    32     China       Qing      Bach
1  Françoise    33   Senegal  Françoise      Bach
2       Raúl    28    España       Raúl    Master
3      Bjork    30    Norway      Bjork       PhD
4      Marie    29     Korea      Marie       PhD

### Ordinal scales

Let's check the information from _df12_:

In [94]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   names      5 non-null      object
 1   ages       5 non-null      int64
 2   countries  5 non-null      object
 3   education  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 200.0+ bytes

The column *education* can be considered ordinal. Let's make a change:

In [95]:
from pandas.api.types import CategoricalDtype

# create a list with the rigth order (ascending)
levels=["Bach","Master","PhD"]

# create levels as a 'customized' ordinal data type
levelsEdu=CategoricalDtype(categories=levels,ordered=True)

# make the change:
df12.education=df12.education.astype(levelsEdu)
df12.education

0      Bach
1      Bach
2    Master
3       PhD
4       PhD
Name: education, dtype: category
Categories (3, object): ['Bach' < 'Master' < 'PhD']

### String operations

Let me create a new data frame:

In [96]:
someData= {"country%":['Perú',"chile","paragua","mexicO"],
           "team":['Incas',"Mapuches","guaranies","Aztecas"],
           "points2021":[99,'ninety','93',None]}
someDF=pd.DataFrame(someData)
someDF

  country%       team points2021
0     Perú      Incas         99
1    chile   Mapuches     ninety
2  paragua  guaranies         93
3   mexicO    Aztecas       None

In [97]:
someDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country%    4 non-null      object
 1   team        4 non-null      object
 2   points2021  3 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [98]:
someDF.columns.str.replace("%","",regex=False)

Index(['country', 'team', 'points2021'], dtype='object')

In [99]:
someDF.columns.str.replace("\d","",regex=True)

Index(['country%', 'team', 'points'], dtype='object')

In [100]:
someDF.columns.str.replace("\%|\d","",regex=True)

Index(['country', 'team', 'points'], dtype='object')

The str.replace function does not have "inplace", then:

In [101]:
someDF.columns=someDF.columns.str.replace("\%|\d","",regex=True)

In [102]:
someDF.country.str.capitalize()

0       Perú
1      Chile
2    Paragua
3     Mexico
Name: country, dtype: object

In [103]:
someDF.team.str.capitalize()

0        Incas
1     Mapuches
2    Guaranies
3      Aztecas
Name: team, dtype: object

In [104]:
someDF.loc[:,['country','team']].str.capitalize()

AttributeError: 'DataFrame' object has no attribute 'str'

In [105]:
someDF.loc[:,['country','team']].apply(lambda x: x.str.capitalize())

   country       team
0     Perú      Incas
1    Chile   Mapuches
2  Paragua  Guaranies
3   Mexico    Aztecas

In [108]:
someDF.loc[:,['country','team']]=someDF.loc[:,['country','team']].apply(lambda x: x.str.capitalize())
someDF

   country       team  points
0     Perú      Incas      99
1    Chile   Mapuches  ninety
2  Paragua  Guaranies      93
3   Mexico    Aztecas    None

The column points is "assumed" to be numeric. Let's change the type with *to_numeric*:

In [110]:
pd.to_numeric(someDF.points)

ValueError: Unable to parse string "ninety" at position 1

By default, to_numeric can not deal with text. Then:

In [111]:
pd.to_numeric(someDF.points,errors='coerce')

0    99.0
1     NaN
2    93.0
3     NaN
Name: points, dtype: float64

Let's make the change and revisit data types:

In [112]:
someDF.points=pd.to_numeric(someDF.points,errors='coerce')
someDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  4 non-null      object
 1   team     4 non-null      object
 2   points   2 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

we got some missing data:

In [113]:
someDF

   country       team  points
0     Perú      Incas    99.0
1    Chile   Mapuches     NaN
2  Paragua  Guaranies    93.0
3   Mexico    Aztecas     NaN

In [114]:
someDF.dropna()

   country       team  points
0     Perú      Incas    99.0
2  Paragua  Guaranies    93.0

In [115]:
someDF.dropna(axis='columns') #dropna has inplace.

   country       team
0     Perú      Incas
1    Chile   Mapuches
2  Paragua  Guaranies
3   Mexico    Aztecas

You could try replacing missing data:

In [116]:
someDF.fillna(95) # anywhere

   country       team  points
0     Perú      Incas    99.0
1    Chile   Mapuches    95.0
2  Paragua  Guaranies    93.0
3   Mexico    Aztecas    95.0

In [118]:
someDF.points.fillna(95)#in a particular column

0    99.0
1    95.0
2    93.0
3    95.0
Name: points, dtype: float64

In [119]:
someDF.points.fillna(95,inplace=True) #this function has 'inplace'
someDF

   country       team  points
0     Perú      Incas    99.0
1    Chile   Mapuches    95.0
2  Paragua  Guaranies    93.0
3   Mexico    Aztecas    95.0


[home](#home)
_____

<a id='part2'></a>


# Exercise.  Data Pre processing

In [132]:
# get the geodaframe

import geopandas as gpd

#zipfile from github
mapLinkZipped='https://github.com/UW-eScience-WinterSchool/Python_Session/raw/main/world_countries_map.zip'

#reading file
countriesMap=gpd.read_file(mapLinkZipped)

# contents
countriesMap

,FIPS,ISO2,ISO3,UN,NAME,AREA,POP2005,REGION,SUBREGION,LON,LAT,geometry
0,AC,AG,ATG,28,Antigua and Barbuda,44,83039,19,29,-61.783,17.078,"MULTIPOLYGON (((-61.68667 17.02444, -61.88722 ..."
1,AG,DZ,DZA,12,Algeria,238174,32854159,2,15,2.632,28.163,"POLYGON ((2.96361 36.80222, 4.78583 36.89472, ..."
2,AJ,AZ,AZE,31,Azerbaijan,8260,8352021,142,145,47.395,40.430,"MULTIPOLYGON (((45.08332 39.76805, 45.81999 39..."
3,AL,AL,ALB,8,Albania,2740,3153731,150,39,20.068,41.143,"POLYGON ((19.43621 41.02107, 19.60056 41.79666..."
4,AM,AM,ARM,51,Armenia,2820,3017661,142,145,44.563,40.534,"POLYGON ((45.15387 41.19860, 46.00194 40.22555..."
...,...,...,...,...,...,...,...,...,...,...,...,...
241,TB,BL,BLM,652,Saint Barthelemy,0,0,19,29,-63.043,18.040,"POLYGON ((-63.02834 18.01555, -63.13984 18.058..."
242,GK,GG,GGY,831,Guernsey,0,0,150,154,-2.576,49.459,"POLYGON ((-2.59083 49.42249, -2.67028 49.43417..."
243,JE,JE,JEY,832,Jersey,0,0,150,154,-2.129,49.219,"POLYGON ((-2.01500 49.21416, -2.20528 49.18083..."
244,SX,GS,SGS,239,South Georgia South Sandwich Islands,0,0,0,0,-36.891,-54.209,"MULTIPOLYGON (((-27.32584 -59.42722, -27.29806..."
245,TW,TW,TWN,158,Taiwan,0,0,0,0,120.946,23.754,"MULTIPOLYGON (((121.57639 22.00139, 121.49026 ..."

Use this map as your main data frame, then add columns from:

* Democracy Index from the Economist (available in [wikipedia](https://en.wikipedia.org/wiki/Democracy_Index))

In [134]:
linkWiki="https://en.wikipedia.org/wiki/Democracy_Index"
democracy=pd.read_html(linkWiki, header=0,attrs={"class":"wikitable sortable"})[4]
democracy.head()

,Rank,.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help}Δ Rank,Country,Regime type,Overall score,Δ Score,Elec­toral pro­cess and plura­lism,Func­tioning of govern­ment,Poli­tical partici­pation,Poli­tical cul­ture,Civil liber­ties
0,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies,Full democracies
1,1,NaN,Norway,Full democracy,9.81,0.06,10.00,9.64,10.00,10.00,9.41
2,2,NaN,Iceland,Full democracy,9.37,0.21,10.00,8.57,8.89,10.00,9.41
3,3,NaN,Sweden,Full democracy,9.26,0.13,9.58,9.29,8.33,10.00,9.12
4,4,NaN,New Zealand,Full democracy,9.25,0.01,10.00,8.93,8.89,8.75,9.71

Add Country, overall score and its five components, and regime type.

* Military expenditures as Share of GDP from [CIA Factbook](https://www.cia.gov/the-world-factbook/field/military-expenditures/country-comparison).

In [137]:
linkmil="https://www.cia.gov/the-world-factbook/field/military-expenditures/country-comparison"
milmoney=pd.read_html(linkmil)[0]
milmoney.head()

   Rank               Country  % of GDP Date of Information
0     1                  Oman      11.0           2020 est.
1     2          Saudi Arabia       7.8           2020 est.
2     3               Algeria       7.0           2020 est.
3     4                Kuwait       6.3           2020 est.
4     5  United Arab Emirates       6.0           2020 est.

Just keep country and share of gdp.

<a id='beginning'></a>

Preprocessing includes three stages:

a. **Cleaning**: Cleaning requires that every cell has the right value, and that the dataframe has only the contents needed. Having a clean data frame means:

    1. Verify that headers are at the top of data frame, and well written.

    2. Verify that categories levels are well written.
    
<br>
    
b. **Formatting**: Formatting requires:
    
    1. Verifiying data types
    
    2. Correcting data types: Numerical, categorical, text, date.
    
<br>
    
c. **Integrating and Saving**: It is process of combining several dataframes in one, and saving it into a file that can be the input of future processes.


_____

<a id='cleanformat'></a>

## a. CLEANING

Let's start by bringing in a table from wikipedia:

In [ ]:
# you need to have 'lxml' and 'beautiful soup' previously installed.
import pandas as pd

LINK_to_WIKIPAGE="https://en.wikipedia.org/wiki/Democracy_Index"

democracy=pd.read_html(LINK_to_WIKIPAGE)

Democracy is not a data frame:

In [ ]:
type(democracy)

This list has this amount of elements:

In [ ]:
len(democracy)

We could shorten the list of results by telling what kind of table you want:

In [ ]:
democracy=pd.read_html(LINK_to_WIKIPAGE, header=0,attrs={"class":"wikitable sortable"})[4]
len(democracy)

Then, our table is:

In [ ]:
democracy[4]

Let's create an object for that data frame:

In [ ]:
demodata=democracy[4].copy()

1. **Verify that headers are at the top of data frame, and well written**.

In [ ]:
# headers are in the right position
# are they well written?
demodata.columns.to_list()

Notice the presence of weird symbols. Let me save this original column names:

In [ ]:
old=demodata.columns.to_list()

You can change using the **brute-force** approach (changing without coding), but let's use **regular expressions** (regex):

* Replacing:

In [ ]:
import re

# \s is 'blanks'
# replace (substitute) space by underscore
old_good=[re.sub("\s","_",name) for name in old]
old_good

In [ ]:
old_better=[re.sub('\W+', '', element) for element in old_good]
old_better

These are the original ones:

In [ ]:
demodata.columns

Let's make a dict with the zip:

In [ ]:
dict(zip(demodata.columns,old_better))

The previous dict can serve to tell python how to rename all columns:

In [ ]:
# just saving the dict
changes=dict(zip(demodata.columns,old_better))

#using the dict
demodata.rename(columns=changes)

The previous view is the result, but no changes have been made:

In [ ]:
demodata

You can make those changes using the **inplace=True** argument:

In [ ]:
demodata.rename(columns=changes,inplace=True)

In [ ]:
# you see:
demodata

You can change just one column name by doing:

In [ ]:
demodata.rename(columns={'Overall_score':'DemoIndex'},inplace=True)
demodata

* Getting rid of columns unneeded:

At this point, you should know be ready to delete some columns (or keep just the ones you need). I want to keep these positions:

In [ ]:
list(range(2,11)) #range from 2 up 11 not inclusive

In [ ]:
# strategy 1: subsetting
keepPositions=list(range(2,10))
keepPositions.remove(5)
keepPositions

In [ ]:
demodata.iloc[:,keepPositions]

In [ ]:
# strategy 2: dropping

#remember the names
demodata.columns

In [ ]:
#use names to drop
bye=['Rank','Δ_Rank','Δ_Score']
demodata.drop(columns=bye)

Let's use strategy 2 this time:

In [ ]:
# result is a new data frame ('inplace' not needed)
demodataok=demodata.drop(columns=bye)
demodataok

2. **Verify that categories levels are well written**.

This requires getting frequency tables:

In [ ]:
demodata.Regime_type.value_counts()

The **level names** are not OK. If you see the table, it has section that have included rows with text in every cell (as you can see in the first row). I will solve this during formatting.

## b. FORMATTING

1. Verifiying data types

In [ ]:
demodataok.info()

The column **Country** is text, which is OK this is **object** data type. 
The Column **Regimetype** should be ordinal,  and the rest should be **numerical**; but they are not.

2. **Correcting data types**:

Let's turn **Regime_type** into ordinal:

In [ ]:
demodataok.Regime_type.value_counts()

For the case of ordinal data, these are the right steps:

In [ ]:
from pandas.api.types import CategoricalDtype

# create a list with the rigth order (ascending)
levels=["Authoritarian","Hybrid regime","Flawed democracy","Full democracy"]

# create levels as a 'customized' ordinal data type
levelsRegime=CategoricalDtype(categories=levels,ordered=True)

# make the change:
demodataok.Regime_type=demodataok.Regime_type.astype(levelsRegime)

See the difference:

In [ ]:
demodataok.Regime_type

Notice that the first row is now a missing value. Since the wrong values are not part of the **levels**, they were turned into NaN. The data type for that column is now OK:

In [ ]:
demodataok.info()

Let me turn the other columns to numeric. Pandas has a function **to_numeric** but it works for ONE column.

In [ ]:
pd.to_numeric(demodataok.iloc[:,2:])

Then we need to **apply** this function to several columns:

In [ ]:
demodataok.iloc[:,2:].apply(pd.to_numeric, errors='coerce')

Notice the use of **coerce** that is the key argument to get missing values: if the function can not turn a value into a number, the function will create a missing value.

Let's save the result now:

In [ ]:
demodataok.iloc[:,2:]=demodataok.iloc[:,2:].apply(pd.to_numeric, errors='coerce')

In [ ]:
# now you get:

demodataok.info()

Remember that we have rows with  missing values:

In [ ]:
demodataok

Here, we need to get rid of those rows full of missing values:

In [ ]:
# Let's use "drop" with "inplace":
demodataok.dropna(how='any',inplace=True)

# you get:
demodataok

Every time you drop rows, you should **reset** the row indexes:

In [ ]:
demodataok.reset_index(drop=True,inplace=True)

Let's get one more data table on Military expenditure:

In [ ]:
linkmil="https://www.cia.gov/the-world-factbook/field/military-expenditures/country-comparison"
milmoney=pd.read_html(linkmil)

In [ ]:
milmoney[0]

This is an almost clean data frame:

In [ ]:
#make new data frame
mildata=milmoney[0].copy()

#get rid of columns unneeded
mildata.drop(columns=['Rank','Date of Information'],inplace=True)

# rename one column
mildata.rename(columns={'% of GDP':'mil_expend'},inplace=True)

# check data types
mildata.info()

This last dataframe is done!

[home](#home)

______

<a id='integratesave'></a>

## INTEGRATING AND SAVING

Let me open this file:

In [ ]:
codesHDI=pd.read_excel("countryCodesHDI.xlsx")
codesHDI

My goal is to add the info from **codesHDI** to  **demodataok**. Let's try this:

In [ ]:
# how='outer' will use all the rows from both data frames
# indicator=True will tell you when you had matches or not.

demohdi=demodataok.merge(codesHDI,left_on='Country', right_on="NAME",how='outer',indicator=True)
demohdi

The last column **_merge** informs if there were matches or not; and also gives details where there was not a match. Let's see what both have in common:

In [ ]:
demohdi[demohdi._merge=='both'] # using the indicator!

Let's see what countries in **demodataok** did not find a match in **codes**:

In [ ]:
demohdi[demohdi._merge=='left_only']

Let's see if those countries exist in **codesHDI** but with different name:

In [ ]:
codesHDI[codesHDI.NAME.str.contains('Korea|Macedonia|Moldo|Tanza|Ivo|Burm|Swazi|Congo|Iran|Viet|Lao|Liby|Syr')]

The function **str.contains** verifies if some string (not the whole word) exist. Now you go manual:

In [ ]:
# the names in demohdi that did not find a match
currentNamesLeft=demohdi[demohdi._merge=='left_only'].Country.to_list()

# the names that will replace the ones in demohdi.
currentNamesRight=['Korea, Republic of','The former Yugoslav Republic of Macedonia','Republic of Moldova',
                  'United Republic of Tanzania',"Cote d'Ivoire",'Burma','Swaziland','Congo','Viet Nam',
                  'Iran (Islamic Republic of)',"Lao People's Democratic Republic",
                  'Libyan Arab Jamahiriya','Syrian Arab Republic',"Korea, Democratic People's Republic of"]

We will replace names. Let's see the dict of replacements:

In [ ]:
dict(zip(currentNamesLeft,currentNamesRight))

Let's replace in **demodataok**:

In [ ]:
###dictionary of replacements:
replacementsForDemo=dict(zip(currentNamesLeft,currentNamesRight))

### replacing
demodataok.Country.replace(replacementsForDemo,inplace=True)

We have altered names of countries in **demodataok**. Let's redo the merge:

In [ ]:
demohdi=demodataok.merge(codesHDI,left_on='Country', right_on="NAME")
demohdi

In [ ]:
#you can drop the repeated column:
demohdi.drop(columns="NAME",inplace=True)

Let me add the data on military expenses...

In [ ]:
demohdimil=demohdi.merge(mildata) #key columns have the same name
demohdimil

You see again that we lost some rows in the merge.

Exercise: Try to recover some rows.

Now, let's save the current **demohdimil** for future Python use, and for future R use:

* For future Python use:

In [ ]:
demohdimil.to_pickle("demohdimil.pkl")
# you will open with: DF=pd.read_pickle("demohdimil.pkl")
# or, if you have link:
# from urllib.request import urlopen
# DF=pd.read_pickle(urlopen("https://..../demohdimil.pkl"),compression=None)

* For future use in R (install rpy2):

In [ ]:
#import os
#os.environ['R_HOME'] = '/Library/Frameworks/R.framework/Resources'

from rpy2.robjects import pandas2ri
pandas2ri.activate()

from rpy2.robjects.packages import importr

base = importr('base')
base.saveRDS(demohdimil,file="demohdimil.RDS")

#In R, you can open it with: DF = readRDS("demohdimil.RDS")
#or, if iyou read from a link: DF = readRDS(url("https://..../demohdimil.RDS")

* An Excel version (install *openpyxl* and *xlrd*)

In [ ]:
demohdimil.to_excel("demohdimil.xlsx",index=False)

FINALLY, let me use Python to alter a map in shapefile format (compressed). You need to install **geopandas**. Then:

In [126]:
import geopandas as gpd

#zipfile from github
mapl='https://github.com/UW-eScience-WinterSchool/Python_Session/raw/main/world_countries_map.zip'

#reading file
mymap=gpd.read_file(mapl)

You can see the result here:

In [127]:
mymap

,FIPS,ISO2,ISO3,UN,NAME,AREA,POP2005,REGION,SUBREGION,LON,LAT,geometry
0,AC,AG,ATG,28,Antigua and Barbuda,44,83039,19,29,-61.783,17.078,"MULTIPOLYGON (((-61.68667 17.02444, -61.88722 ..."
1,AG,DZ,DZA,12,Algeria,238174,32854159,2,15,2.632,28.163,"POLYGON ((2.96361 36.80222, 4.78583 36.89472, ..."
2,AJ,AZ,AZE,31,Azerbaijan,8260,8352021,142,145,47.395,40.430,"MULTIPOLYGON (((45.08332 39.76805, 45.81999 39..."
3,AL,AL,ALB,8,Albania,2740,3153731,150,39,20.068,41.143,"POLYGON ((19.43621 41.02107, 19.60056 41.79666..."
4,AM,AM,ARM,51,Armenia,2820,3017661,142,145,44.563,40.534,"POLYGON ((45.15387 41.19860, 46.00194 40.22555..."
...,...,...,...,...,...,...,...,...,...,...,...,...
241,TB,BL,BLM,652,Saint Barthelemy,0,0,19,29,-63.043,18.040,"POLYGON ((-63.02834 18.01555, -63.13984 18.058..."
242,GK,GG,GGY,831,Guernsey,0,0,150,154,-2.576,49.459,"POLYGON ((-2.59083 49.42249, -2.67028 49.43417..."
243,JE,JE,JEY,832,Jersey,0,0,150,154,-2.129,49.219,"POLYGON ((-2.01500 49.21416, -2.20528 49.18083..."
244,SX,GS,SGS,239,South Georgia South Sandwich Islands,0,0,0,0,-36.891,-54.209,"MULTIPOLYGON (((-27.32584 -59.42722, -27.29806..."
245,TW,TW,TWN,158,Taiwan,0,0,0,0,120.946,23.754,"MULTIPOLYGON (((121.57639 22.00139, 121.49026 ..."

Maps have metadata, you want to know the projection information:

In [128]:
mymap.crs

<Geographic 2D CRS: EPSG:4326>
Name: WGS 84
Axis Info [ellipsoidal]:
- Lat[north]: Geodetic latitude (degree)
- Lon[east]: Geodetic longitude (degree)
Area of Use:
- name: World
- bounds: (-180.0, -90.0, 180.0, 90.0)
Datum: World Geodetic System 1984
- Ellipsoid: WGS 84
- Prime Meridian: Greenwich

Let me export the **geoDataFrame** a a **geojson** file:

In [129]:
mymap.to_file("mymap.geojson", driver='GeoJSON')

The error tells you that _somewhere_ you have a **bytes** data type, which is not allowed in geojson. You do not see it here:

In [130]:
mymap.info()

<class 'geopandas.geodataframe.GeoDataFrame'>
RangeIndex: 246 entries, 0 to 245
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   FIPS       243 non-null    object
 1   ISO2       246 non-null    object
 2   ISO3       246 non-null    object
 3   UN         246 non-null    int64
 4   NAME       246 non-null    object
 5   AREA       246 non-null    int64
 6   POP2005    246 non-null    int64
 7   REGION     246 non-null    int64
 8   SUBREGION  246 non-null    int64
 9   LON        246 non-null    float64
 10  LAT        246 non-null    float64
 11  geometry   246 non-null    geometry
dtypes: float64(2), geometry(1), int64(5), object(4)
memory usage: 23.2+ KB

Then I need to make a loop to find where it is:

In [125]:
for column in mymap:
    for cell in mymap[column]:
        if type(cell)==bytes:
            print(column,cell)

NAME b'\xc5land Islands'

Once you find the column:

In [ ]:
#change type to string
mymap.NAME = mymap.NAME.astype(str)

You should not have further problems:

In [ ]:
mymap.to_file("mymap.geojson", driver='GeoJSON')